Rajan-Dobariya/7seg-mspm0g3507/Debug/syscfg/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                     32000000




/* Port definition for Pin Group SEGMENT_DISPLAY_1 */
#define SEGMENT_DISPLAY_1_PORT                                           (GPIOA)

/* Defines for SEG_A: GPIOA.8 with pinCMx 19 on package pin 54 */
#define SEGMENT_DISPLAY_1_SEG_A_PIN                              (DL_GPIO_PIN_8)
#define SEGMENT_DISPLAY_1_SEG_A_IOMUX                            (IOMUX_PINCM19)
/* Defines for SEG_B: GPIOA.9 with pinCMx 20 on package pin 55 */
#define SEGMENT_DISPLAY_1_SEG_B_PIN                              (DL_GPIO_PIN_9)
#define SEGMENT_DISPLAY_1_SEG_B_IOMUX                            (IOMUX_PINCM20)
/* Defines for SEG_C: GPIOA.10 with pinCMx 21 on package pin 56 */
#define SEGMENT_DISPLAY_1_SEG_C_PIN                             (DL_GPIO_PIN_10)
#define SEGMENT_DISPLAY_1_SEG_C_IOMUX                            (IOMUX_PINCM21)
/* Defines for SEG_D: GPIOA.11 with pinCMx 22 on package pin 57 */
#define SEGMENT_DISPLAY_1_SEG_D_PIN                             (DL_GPIO_PIN_11)
#define SEGMENT_DISPLAY_1_SEG_D_IOMUX                            (IOMUX_PINCM22)
/* Defines for SEG_E: GPIOA.12 with pinCMx 34 on package pin 5 */
#define SEGMENT_DISPLAY_1_SEG_E_PIN                             (DL_GPIO_PIN_12)
#define SEGMENT_DISPLAY_1_SEG_E_IOMUX                            (IOMUX_PINCM34)
/* Defines for SEG_F: GPIOA.13 with pinCMx 35 on package pin 6 */
#define SEGMENT_DISPLAY_1_SEG_F_PIN                             (DL_GPIO_PIN_13)
#define SEGMENT_DISPLAY_1_SEG_F_IOMUX                            (IOMUX_PINCM35)
/* Defines for SEG_G: GPIOA.15 with pinCMx 37 on package pin 8 */
#define SEGMENT_DISPLAY_1_SEG_G_PIN                             (DL_GPIO_PIN_15)
#define SEGMENT_DISPLAY_1_SEG_G_IOMUX                            (IOMUX_PINCM37)
/* Port definition for Pin Group SEGMENT_DISPLAY_2 */
#define SEGMENT_DISPLAY_2_PORT                                           (GPIOA)

/* Defines for SEG_H: GPIOA.16 with pinCMx 38 on package pin 9 */
#define SEGMENT_DISPLAY_2_SEG_H_PIN                             (DL_GPIO_PIN_16)
#define SEGMENT_DISPLAY_2_SEG_H_IOMUX                            (IOMUX_PINCM38)
/* Defines for SEG_I: GPIOA.17 with pinCMx 39 on package pin 10 */
#define SEGMENT_DISPLAY_2_SEG_I_PIN                             (DL_GPIO_PIN_17)
#define SEGMENT_DISPLAY_2_SEG_I_IOMUX                            (IOMUX_PINCM39)
/* Defines for SEG_J: GPIOA.18 with pinCMx 40 on package pin 11 */
#define SEGMENT_DISPLAY_2_SEG_J_PIN                             (DL_GPIO_PIN_18)
#define SEGMENT_DISPLAY_2_SEG_J_IOMUX                            (IOMUX_PINCM40)
/* Defines for SEG_K: GPIOA.22 with pinCMx 47 on package pin 18 */
#define SEGMENT_DISPLAY_2_SEG_K_PIN                             (DL_GPIO_PIN_22)
#define SEGMENT_DISPLAY_2_SEG_K_IOMUX                            (IOMUX_PINCM47)
/* Defines for SEG_L: GPIOA.25 with pinCMx 55 on package pin 26 */
#define SEGMENT_DISPLAY_2_SEG_L_PIN                             (DL_GPIO_PIN_25)
#define SEGMENT_DISPLAY_2_SEG_L_IOMUX                            (IOMUX_PINCM55)
/* Defines for SEG_M: GPIOA.26 with pinCMx 59 on package pin 30 */
#define SEGMENT_DISPLAY_2_SEG_M_PIN                             (DL_GPIO_PIN_26)
#define SEGMENT_DISPLAY_2_SEG_M_IOMUX                            (IOMUX_PINCM59)
/* Defines for SEG_N: GPIOA.27 with pinCMx 60 on package pin 31 */
#define SEGMENT_DISPLAY_2_SEG_N_PIN                             (DL_GPIO_PIN_27)
#define SEGMENT_DISPLAY_2_SEG_N_IOMUX                            (IOMUX_PINCM60)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);



#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
